1)  Первая задача:
    
    Найти сумму цифр трехзначного числа.

 1. Без цикла:
    a = int(input('enter three-digit number'))
    n1 = a % 10
    n2 = a // 10 % 10
    n3 = a // 100
    print(n1 + n2 + n3)
    
 2. С циклом:
    a = int(input('Введите трехзначное число: '))
    result = 0
    if a > 999 or a < 100:
        print('введенное число не трехзначное')
    else:
        for i in range(3):
            result += a % 10
            a //= 10
        print('Сумма  цифр равна :' ,result)

2)  Вторая задача:
    
    Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
    Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали 
    одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, 
    чем Петя и Сережа вместе?

    a = int(input('Введите итоговое количество сделанных журавликов: '))
    if a % 6 != 0:
        print('Задача не имеет целочисленного решения')
    else:
        print('Петя и Сережа сделали по ', a / 6)
        print('Катя сделала ', a / 3 * 2)

3)  Третья задача:
    
    Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и 
    получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, 
    где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 - счастливый, 
    т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

 1. Первый вариант решения (через деление и типом "int"):

    a = int(input('enter ticket number: '))
    result1 = 0
    result2 = 0
    if a < 100000 or a > 999999:
        print('ticket number consists of six digits. Rewrite ticket number.')
    else:
        for i in range(6):
            if i < 3:
                result1 += a % 10
            else:
                result2 += a % 10
            a //= 10
        if result1 == result2:
            print('lucky ticket!!')
        else:
            print('bad luck.')

 2. Второй вариант решения (без цикла):

    a = int(input('enter six-digit number'))
    n1 = a % 10
    n2 = a // 10 % 10
    n3 = a // 100 % 10
    n4 = a // 1000 % 10
    n5 = a // 10000 % 10
    n6 = a // 100000 % 10
    result1 = n1 + n2 + n3
    result2 = n4 + n5 + n6
    if result1 == result2:
        print('lucky ticket!!')
    else:
        print('bad luck.')
 3. Третий вариант решения (через строки):
    #По идее, когда присваиваем значение переменной через input(),
    #по умолчанию используется тип string. Но у меня при проверке (print(type(a)))
    #почему то тип был int. Пришлось вручную присваивать.
    a = input('enter six-digit number')
    result1 = 0
    result2 = 0
    for i in range(len(a)):
    if i < len(a) / 2:
        result1 += int(a[i:i+1])
    else:
        result2 += int(a[i:i+1])
if result1 == result2:
    print('lucky ticket!!')
else:
    print('bad luck.')

4)  Четвертая задача:
    
    Требуется определить, можно ли от шоколадки размером n * m долек отломить k долек, если разрешается 
    сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
    
    m = int(input('Введите длинну шоколадки (в дольках): '))
    n = int(input('Введите ширину шоколадки (в дольках): '))
    k = int(input('Сколько долек отломить? '))
    if k > m * n:
        print('Нельзя отломить больше чем есть в шоколадке: ', m * n) 
    elif k == n * m:
        print('Бери шоколадку целиком')
    elif k % m == 0 or k % n == 0:
        print('Yes')
    else:
        print('No')
